# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [19]:
import pandas as pd 
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [20]:
pd.read_csv("C:/Python_pandas/users_data.csv")

,user_id,age,gender,occupation,zip_code
0,1,24.0,M,technician,85711.0
1,2,53.0,F,other,94043.0
2,3,23.0,M,writer,32067.0
3,4,24.0,M,technician,43537.0
4,5,33.0,F,other,15213.0
5,6,42.0,M,executive,98101.0
6,7,57.0,M,administrator,91344.0
7,8,36.0,M,administrator,5201.0
8,9,29.0,M,student,1002.0
9,10,53.0,M,lawyer,90703.0
10,... (truncated for brevity; assuming full data...,NaN,NaN,NaN,NaN
11,500,28.0,M,administrator,94305.0

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [21]:
users = pd.read_csv("C:/Python_pandas/users_data.csv")

In [46]:
users = pd.read_csv("C:/Python_pandas/users_data.csv", index_col= 'user_id')

### Step 4. See the first 25 entries

In [47]:
users.head(25)

,age,gender,occupation,zip_code
user_id,,,,
1,24.0,M,technician,85711.0
2,53.0,F,other,94043.0
3,23.0,M,writer,32067.0
4,24.0,M,technician,43537.0
5,33.0,F,other,15213.0
6,42.0,M,executive,98101.0
7,57.0,M,administrator,91344.0
8,36.0,M,administrator,5201.0
9,29.0,M,student,1002.0
10,53.0,M,lawyer,90703.0
... (truncated for brevity; assuming full dataset was provided),NaN,NaN,NaN,NaN
500,28.0,M,administrator,94305.0

### Step 5. See the last 10 entries

In [6]:
users.tail(10)

,age,gender,occupation,zip_code
user_id,,,,
3,23.0,M,writer,32067.0
4,24.0,M,technician,43537.0
5,33.0,F,other,15213.0
6,42.0,M,executive,98101.0
7,57.0,M,administrator,91344.0
8,36.0,M,administrator,5201.0
9,29.0,M,student,1002.0
10,53.0,M,lawyer,90703.0
... (truncated for brevity; assuming full dataset was provided),NaN,NaN,NaN,NaN
500,28.0,M,administrator,94305.0

### Step 6. What is the number of observations in the dataset?

In [13]:
users.shape[0]

12

### Step 7. What is the number of columns in the dataset?

In [23]:
users.shape[1]

5

### Step 8. Print the name of all the columns.

In [24]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [25]:
users.index    # labels or index

RangeIndex(start=0, stop=12, step=1)

### Step 10. What is the data type of each column?

In [26]:
users.dtypes

user_id        object
age           float64
gender         object
occupation     object
zip_code      float64
dtype: object

In [28]:
users.info

<bound method DataFrame.info of                                               user_id   age gender  \
0                                                   1  24.0      M
1                                                   2  53.0      F
2                                                   3  23.0      M
3                                                   4  24.0      M
4                                                   5  33.0      F
5                                                   6  42.0      M
6                                                   7  57.0      M
7                                                   8  36.0      M
8                                                   9  29.0      M
9                                                  10  53.0      M
10  ... (truncated for brevity; assuming full data...   NaN    NaN
11                                                500  28.0      M

       occupation  zip_code
0      technician   85711.0
1           other   94043.0
2          writer   32067.0
3      technician   43537.0
4           other   15213.0
5       executive   98101.0
6   administrator   91344.0
7   administrator    5201.0
8         student    1002.0
9          lawyer   90703.0
10            NaN       NaN
11  administrator   94305.0  >

### Step 11. Print only the occupation column

In [29]:
print(users['occupation'])

0        technician
1             other
2            writer
3        technician
4             other
5         executive
6     administrator
7     administrator
8           student
9            lawyer
10              NaN
11    administrator
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [36]:
users['occupation'].nunique()

7

### Step 13. What is the most frequent occupation?

In [32]:
users['occupation'].value_counts().head(1)

occupation
administrator    3
Name: count, dtype: int64

### Step 14. Summarize the DataFrame.

In [35]:
users.describe()

             age      zip_code
count  11.000000     11.000000
mean   36.545455  59202.454545
std    12.769993  39884.178451
min    23.000000   1002.000000
25%    26.000000  23640.000000
50%    33.000000  85711.000000
75%    47.500000  92693.500000
max    57.000000  98101.000000

### Step 15. Summarize all the columns

In [38]:
users.describe(include='all')

       user_id        age gender     occupation      zip_code
count       12  11.000000     11             11     11.000000
unique      12        NaN      2              7           NaN
top          1        NaN      M  administrator           NaN
freq         1        NaN      9              3           NaN
mean       NaN  36.545455    NaN            NaN  59202.454545
std        NaN  12.769993    NaN            NaN  39884.178451
min        NaN  23.000000    NaN            NaN   1002.000000
25%        NaN  26.000000    NaN            NaN  23640.000000
50%        NaN  33.000000    NaN            NaN  85711.000000
75%        NaN  47.500000    NaN            NaN  92693.500000
max        NaN  57.000000    NaN            NaN  98101.000000

### Step 16. Summarize only the occupation column

In [39]:
users['occupation'].describe()

count                11
unique                7
top       administrator
freq                  3
Name: occupation, dtype: object

In [40]:
users.occupation.describe()

count                11
unique                7
top       administrator
freq                  3
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [41]:
round(users['age'].mean())

37

### Step 18. What is the age with least occurrence?

In [45]:
users['age'].value_counts().tail()

age
42.0    1
57.0    1
36.0    1
29.0    1
28.0    1
Name: count, dtype: int64